def replace_weird_characters(word):
    replacements = {
        "é": "e", "è": "e", "ê": "e", "ë": "e",
        "á": "a", "à": "a", "â": "a", "ä": "a", "ã": "a", "å": "a", "ā": "a",
        "í": "i", "ì": "i", "î": "i", "ï": "i", "ī": "i",
        "ó": "o", "ò": "o", "ô": "o", "ö": "o", "õ": "o", "ø": "o", "ō": "o",
        "ú": "u", "ù": "u", "û": "u", "ü": "u", "ū": "u",
        "ç": "c", "ć": "c", "č": "c",
        "ñ": "n", "ń": "n",
        "ß": "ss",
        "ý": "y", "ÿ": "y",
        "ž": "z", "ź": "z", "ż": "z",
        "š": "s", "ś": "s",
        "ł": "l",
        "đ": "d",
        "ğ": "g",
        "ř": "r",
        "ť": "t",
        "ď": "d",
        "ą": "a",
        "ę": "e",
        "œ": "oe",
        "æ": "ae"
    }
    for orig, repl in replacements.items():
        word = word.replace(orig, repl)
    return word